Revit 2024 API
IExternalService.GetServiceId Method
 Implement this method to return the unique Id of the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
ExternalServiceId GetServiceId()
Visual Basic
Function GetServiceId As ExternalServiceId
Visual C++
ExternalServiceId^ GetServiceId()
Return Value
 The extensible enum value representing the Id of the service.
Remarks
For all built-in external services, their Ids are all items of the enumerated type ExternalServices.BuiltInExternalServices.
Third-party services will have their respective Ids based on GUIDs. It is important to note that a service Id must be unique. It will be an error if two external services try to register with the same Id.
See Also
IExternalService Interface
Autodesk.Revit.DB.ExternalService Namespace